wiki/统计名词wiki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>统计名词解释wiki</title>
<meta name="generator" content="Org mode" />
<link href="/Users/luyajun/Documents/坚果云/我的坚果云/github/code/css/org-mode.css" rel="stylesheet" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">统计名词解释wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54c6e9b">1. 线性回归模型</a>
<ul>
<li>
<ul>
<li><a href="#orgb0c9d15">1.0.1. 数据变换</a></li>
<li><a href="#org32ff0ab">1.0.2. 处理缺失值</a></li>
<li><a href="#org8d9a326">1.0.3. 移除预测变量</a></li>
<li><a href="#orgdc6e9f3">1.0.4. 相关系数</a></li>
<li><a href="#org01f009b">1.0.5. 训练集、验证集、测试集</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd313396">2. logistic回归模型</a>
<ul>
<li><a href="#org8036485">2.1. deviance</a>
<ul>
<li><a href="#org427279b">2.1.1. null deviance</a></li>
<li><a href="#org1978bc3">2.1.2. residual deviance</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org54c6e9b" class="outline-2">
<h2 id="org54c6e9b"><span class="section-number-2">1</span> 线性回归模型</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb0c9d15" class="outline-4">
<h4 id="orgb0c9d15"><span class="section-number-4">1.0.1</span> 数据变换</h4>
<div class="outline-text-4" id="text-1-0-1">
<ul class="org-ul">
<li>单变量数据变换</li>
</ul>

<p>
包括中心化和标准化，数据变换可以解决偏度问题，比如利用 box-cox 数据变换。
</p>

<ul class="org-ul">
<li>多变量数据变换</li>
</ul>

<p>
解决离群值问题数据变换：空间表示变换
</p>
</div>
</div>

<div id="outline-container-org32ff0ab" class="outline-4">
<h4 id="org32ff0ab"><span class="section-number-4">1.0.2</span> 处理缺失值</h4>
<div class="outline-text-4" id="text-1-0-2">
<p>
在处理缺失值的时候s，应该首先了解缺失的原因，应该调查数据缺失是否和结果变量有关。例如，药物无效，病人不来就医，直接退出实验，这种缺失就不行。
</p>
</div>
</div>
<div id="outline-container-org8d9a326" class="outline-4">
<h4 id="org8d9a326"><span class="section-number-4">1.0.3</span> 移除预测变量</h4>
<div class="outline-text-4" id="text-1-0-3">
<p>
需要注意近零方差预测变量的黄金准则：
</p>

<p>
1、不重复取值的数目与样本量的比值低（如 10%）
</p>

<p>
2、最高频数和次高频数的比值高（如 20%左右）
</p>
</div>
</div>

<div id="outline-container-orgdc6e9f3" class="outline-4">
<h4 id="orgdc6e9f3"><span class="section-number-4">1.0.4</span> 相关系数</h4>
<div class="outline-text-4" id="text-1-0-4">
<p>
\[
r ( X , Y ) = \frac { \operatorname { Cov } ( X , Y ) } { \sqrt { \operatorname { Var } [ X ] \operatorname { Var } [ Y ] } }
\]
</p>

<p>
其中， \(cov(X,Y)\) 为 \(X\) 与 \(Y\) 的协方差, \(Var[X]\) 为 \(X\) 的方差，\(Var[Y]\)
为 \(Y\) 的方差。
</p>

<p>
样本协方差的计算公式：\(cov _ { x y } = \frac { 1 } { n - 1 } \sum _ { i = 1 } ^ { n } \left( x _ { i } - \overline { x } \right) \left( y _ { i } - \overline { y } \right)\)
</p>

<p>
样本方差的计算公式： \(s ^ { 2 } = \frac { \sum \left( X _ { i } - \bar{X} \right) ^ { 2 } } { n - 1 }\)
</p>
</div>
</div>

<div id="outline-container-org01f009b" class="outline-4">
<h4 id="org01f009b"><span class="section-number-4">1.0.5</span> 训练集、验证集、测试集</h4>
<div class="outline-text-4" id="text-1-0-5">
<p>
现在假设你在两个模型（一个线性模型和一个多项式模型）之间犹豫不决：如何判断？做法是训练两个模型，然后对比它们对测试数据的泛化能力。（说白了用新的数据去验证模型的预测能力，用mse、auc指标去验证）。
</p>

<p>
<b>如果数据是80%的数据进行训练，保留另外的20%来做测试,这样的模型泛化误差最小，比如5%，但是实际生产环境中，这样的误差可能会达到15%。</b>
</p>

<p>
为啥会出现这样的问题？
</p>

<p>
问题出在你对测试集的泛化误差进行了多次度量，并且调整模型和超参数来得到拟合那个测试集的最佳模型。这就意味着该模型对于新的数据不太可能有良好的表现。
</p>

<p>
常见的解决方案是再单独分出来一个保留集合， <b><b>称为验证集</b></b>.在训练集上，使用不同的超参数训练多个模型，然后通过验证集，选择最好的那个模型和对应的超参数，当你对模型基本满意之后，再用测试集运行最后一轮测试，并得到泛化误差的估值。
</p>

<p>
为了避免验证集“浪费“太多的训练数据，常见的技术是使用交叉验证；
将训练集分成若干个互补子集进行验证。一旦模型和超参数都被选定，
最终的模型会带着这些超参数对整个训练集进行一次训练，最后再用
测试集测量泛化误差。
</p>
</div>
</div>
</div>
<div id="outline-container-orgd313396" class="outline-2">
<h2 id="orgd313396"><span class="section-number-2">2</span> logistic回归模型</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8036485" class="outline-3">
<h3 id="org8036485"><span class="section-number-3">2.1</span> deviance</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Deviance is a measure of goodness of fit of a generalized linear model.
Or rather, it’s a measure of badness of fit–higher numbers indicate worse fit.R reports two forms of deviance – the null deviance and the residual deviance.
</p>
</div>
<div id="outline-container-org427279b" class="outline-4">
<h4 id="org427279b"><span class="section-number-4">2.1.1</span> null deviance</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The null deviance shows how well the response variable is predicted by a model that includes only the intercept (grand mean).
</p>

<p>
Null Deviance = 2(LL(Saturated Model) - LL(Null Model)) on df = df<sub>Sat</sub> - df<sub>Null</sub>
</p>
</div>
</div>
<div id="outline-container-org1978bc3" class="outline-4">
<h4 id="org1978bc3"><span class="section-number-4">2.1.2</span> residual deviance</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Residual Deviance = 2(LL(Saturated Model) - LL(Proposed Model)) df = df<sub>Sat</sub> - df<sub>Proposed</sub>
</p>

<p>
The Saturated Model is a model that assumes each data point has its own parameters (which means you have n parameters to estimate.)
</p>

<p>
The Null Model assumes the exact "opposite", in that is assumes one parameter for all of the data points, which means you only estimate 1 parameter.
</p>

<p>
The Proposed Model assumes you can explain your data points with p parameters + an intercept term, so you have p+1 parameters.
</p>

<p>
If your Null Deviance is really small, it means that the Null Model explains the data pretty well. Likewise with your Residual Deviance.
</p>

<p>
What does really small mean? If your model is "good" then your Deviance is approx Chi<sup>2</sup> with (df<sub>sat</sub> - df<sub>model</sub>) degrees of freedom.
</p>

<p>
(Null Deviance - Residual Deviance) approx Chi<sup>2</sup> with df Proposed - df Null = (n-(p+1))-(n-1)=p
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
